Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0154] The connection resume rejection message is used to indicate that resuming of the RRC connection that is performed by the terminal is rejected.
de_de: [0154] Die Verbindungswiederaufnahmeablehnungsnachricht wird verwendet, um anzugeben, dass die Wiederaufnahme der RRC-Verbindung, die durch das Endgerät durchgeführt wird, abgelehnt wird.

source: [0155] Optionally, information about a wait timer (wait timer) may be carried in the connection resume rejection message, where the information about the wait timer is used to indicate a time for rejecting access by the terminal, and may also be understood as a minimum time length that the terminal needs to wait before re-requesting to resume the RRC connection.
de_de: [0155] Optional können Informationen über einen Wartezeitgeber (Wartezeitgeber) in der Verbindungswiederaufnahmeablehnungsnachricht geführt werden, wobei die Informationen über den Wartezeitgeber verwendet werden, um eine Zeit zum Ablehnen des Zugriffs durch das Endgerät anzugeben, und können auch als eine Mindestzeitdauer verstanden werden, die das Endgerät warten muss, bevor es erneut anfordert, die RRC-Verbindung wiederaufzunehmen.

source: For example, if the information about the wait timer indicates 30 minutes, the information is used to instruct the terminal to wait at least 30 minutes before re-initiating a connection resume request.
de_de: Wenn zum Beispiel die Informationen über den Wartezeitgeber 30 Minuten angeben, werden die Informationen verwendet, um das Endgerät anzuweisen, mindestens 30 Minuten zu warten, bevor eine Verbindungswiederaufnahmeanforderung erneut initiiert wird.

source: That is, actions in step 301 and step 302 are re-performed, and a next connection resume request procedure is entered.
de_de: Das heißt, die Aktionen in Schritt 301 und Schritt 302 werden erneut durchgeführt, und es wird in eine nächste Verbindungswiederaufnahmeanforderungsprozedur eingetreten.

source: [0156] Step 305: The target base station sends a context request message to the source base station, and the source base station receives the context request message from the target base station.
de_de: [0156] Schritt 305: Die Zielbasisstation sendet eine Kontextanforderungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Kontextanforderungsnachricht von der Zielbasisstation.

source: [0157] The context request message is used to request a context of the terminal.
de_de: [0157] Die Kontextanforderungsnachricht wird verwendet, um einen Kontext des Endgeräts anzufordern.

source: [0158] In an implementation, when determining to accept the connection resume request of the terminal, the target base station obtains a resume identifier from the connection resume request message.
de_de: [0158] In einer Implementierung, wenn bestimmt wird, die Verbindungswiederaufnahmeanforderung des Endgeräts anzunehmen, erhält die Zielbasisstation eine Wiederaufnahmekennung aus der Verbindungswiederaufnahmeanforderungsnachricht.

source: When determining, based on an identifier of the source base station that is in the resume identifier, that the terminal is previously connected to the source base station, the target base station sends the context request message to the source base station, where the context request message is used to request to obtain the context of the terminal, and the context request message carries the resume identifier and the message authentication code.
de_de: Wenn basierend auf einer Kennung der Quellbasisstation, die in der Wiederaufnahmekennung ist, bestimmt wird, dass das Endgerät zuvor mit der Quellbasisstation verbunden ist, sendet die Zielbasisstation die Kontextanforderungsnachricht an die Quellbasisstation, wobei die Kontextanforderungsnachricht verwendet wird, um anzufordern, den Kontext des Endgeräts zu erhalten, und die Kontextanforderungsnachricht die Wiederaufnahmekennung und den Nachrichtenauthentifizierungscode führt.

source: [0159] After receiving the context request message sent by the target base station, the source base station obtains the resume identifier from the context request message, and obtains an access stratum context of the terminal based on an identifier of the terminal that is in the resume identifier, where the access stratum context includes a security capability of the terminal. Optionally, the obtained access stratum context of the terminal further includes information such as an encryption algorithm and an integrity protection algorithm that are negotiated between the terminal and the source base station.
de_de: [0159] Nach dem Empfangen der von der Zielbasisstation gesendeten Kontextanforderungsnachricht erhält die Quellbasisstation die Wiederaufnahmekennung aus der Kontextanforderungsnachricht und erhält einen Zugriffsschichtkontext des Endgeräts basierend auf einer Kennung des Endgeräts, die in der Wiederaufnahmekennung ist, wobei der Zugriffsschichtkontext eine Sicherheitsfähigkeit des Endgeräts enthält. Optional enthält der erhaltene Zugriffsschichtkontext des Endgeräts ferner Informationen wie einen Verschlüsselungsalgorithmus und einen Integritätsschutzalgorithmus, die zwischen dem Endgerät und der Quellbasisstation ausgehandelt werden.

source: [0160] Step 306: The source base station obtains the context of the terminal if checking the message authentication code to be successful.
de_de: [0160] Schritt 306: Die Quellbasisstation erhält den Kontext des Endgeräts, wenn überprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0161] A method for checking the message authentication code by the source base station corresponds to a method for generating the message authentication code by the terminal.
de_de: [0161] Ein Verfahren zum Überprüfen des Nachrichtenauthentifizierungscodes durch die Quellbasisstation entspricht einem Verfahren zum Erzeugen des Nachrichtenauthentifizierungscodes durch das Endgerät.

source: [0162] If the terminal generates the message authentication code in the foregoing manner 1, a manner in which the source base station checks the message authentication code is as follows: The source base station obtains an integrity protection algorithm (which may also be referred to as an integrity protection algorithm of the source base station) and an access stratum key that are in the context of the terminal, and then obtains an integrity protection key (which may also be referred to as an integrity protection key of the source base station) through derivation based on the integrity protection algorithm and the access stratum key, or the source base station obtains an integrity protection algorithm (which may also be referred to as an integrity protection algorithm of the source base station) and an integrity protection key (which may also be referred to as an integrity protection key of the source base station) that are in the context of the terminal. Then, the source base station generates the message authentication code based on the integrity protection algorithm of the source base station and the integrity protection key of the source base station, and compares the generated message authentication code with a message authentication code in the context request message.
de_de: [0162] Wenn das Endgerät den Nachrichtenauthentifizierungscode auf die vorstehende Weise 1 erzeugt, ist eine Weise, in der die Quellbasisstation den Nachrichtenauthentifizierungscode überprüft, wie folgt: Die Quellbasisstation erhält einen Integritätsschutzalgorithmus (der auch als ein Integritätsschutzalgorithmus der Quellbasisstation bezeichnet werden kann) und einen Zugriffsschichtschlüssel, die sich im Kontext des Endgeräts befinden, und erhält dann einen Integritätsschutzschlüssel (der auch als ein Integritätsschutzschlüssel der Quellbasisstation bezeichnet werden kann) durch Ableitung basierend auf dem Integritätsschutzalgorithmus und dem Zugriffsschichtschlüssel, oder die Quellbasisstation erhält einen Integritätsschutzalgorithmus (der auch als ein Integritätsschutzalgorithmus der Quellbasisstation bezeichnet werden kann) und einen Integritätsschutzschlüssel (der auch als ein Integritätsschutzschlüssel der Quellbasisstation bezeichnet werden kann), die sich im Kontext des Endgeräts befinden. Dann erzeugt die Quellbasisstation den Nachrichtenauthentifizierungscode basierend auf dem Integritätsschutzalgorithmus der Quellbasisstation und dem Integritätsschutzschlüssel der Quellbasisstation und vergleicht den erzeugten Nachrichtenauthentifizierungscode mit einem Nachrichtenauthentifizierungscode in der Kontextanforderungsnachricht.

source: If the generated message authentication code is the same as the message authentication code in the context request message, the check is successful.
de_de: Wenn der erzeugte Nachrichtenauthentifizierungscode der gleiche wie der Nachrichtenauthentifizierungscode in der Kontextanforderungsnachricht ist, ist die Überprüfung erfolgreich.

source: If the generated message authentication code is different from the message authentication code in the context request message, the check is failed.
de_de: Wenn sich der erzeugte Nachrichtenauthentifizierungscode von dem Nachrichtenauthentifizierungscode in der Kontextanforderungsnachricht unterscheidet, ist die Überprüfung fehlgeschlagen.

source: [0163] If the terminal generates the message authentication code in the foregoing manner 2, a manner in which the source base station checks the message authentication code is as follows: The source base station determines whether a next hop NH is used; and if the next hop NH is not used, the source base station obtains a new access stratum key KgNB* based on the NH; or if the next hop NH is used, the source base station obtains a new access stratum key KgNB* based on a current access stratum key KgNB of the terminal. After obtaining KgNB*, the source base station generates Krrc-int* based on KgNB*, an identifier of the integrity protection algorithm of the source base station, and a type of the integrity protection algorithm of the source base station, then generates the message authentication code by using Krrc-int* and the integrity protection algorithm of the source base station, and compares the generated message authentication code with a message authentication code in the context request message.
de_de: [0163] Wenn das Endgerät den Nachrichtenauthentifizierungscode auf die vorstehende Weise 2 erzeugt, ist eine Weise, in der die Quellbasisstation den Nachrichtenauthentifizierungscode überprüft, wie folgt: Die Quellbasisstation bestimmt, ob ein nächster Hop NH verwendet wird; und wenn der nächste Hop NH nicht verwendet wird, erhält die Quellbasisstation einen neuen Zugriffsschichtschlüssel KgNB* basierend auf dem NH; oder wenn der nächste Hop NH verwendet wird, erhält die Quellbasisstation einen neuen Zugriffsschichtschlüssel KgNB* basierend auf einem aktuellen Zugriffsschichtschlüssel KgNB des Endgeräts. Nach dem Erhalten von KgNB* erzeugt die Quellbasisstation Krrc-int* basierend auf KgNB*, einer Kennung des Integritätsschutzalgorithmus der Quellbasisstation und einem Typ des Integritätsschutzalgorithmus der Quellbasisstation, erzeugt dann den Nachrichtenauthentifizierungscode unter Verwendung von Krrc-int* und des Integritätsschutzalgorithmus der Quellbasisstation und vergleicht den erzeugten Nachrichtenauthentifizierungscode mit einem Nachrichtenauthentifizierungscode in der Kontextanforderungsnachricht.

source: If the generated message authentication code is different from the message authentication code in the context request message, the check is failed
de_de: Wenn sich der erzeugte Nachrichtenauthentifizierungscode von dem Nachrichtenauthentifizierungscode in der Kontextanforderungsnachricht unterscheidet, ist die Überprüfung fehlgeschlagen.

source: [0164] Optionally, the source base station may alternatively generate the message authentication code based on the integrity protection key, a source PCI, a source cell radio network temporary identifier (cell radio network temporary identifier, C-RNTI), a target cell identifier, and a resume constant.
de_de: [0164] Optional kann die Quellbasisstation alternativ den Nachrichtenauthentifizierungscode basierend auf dem Integritätsschutzschlüssel, einer Quellen-PCI, einer temporären Quellen-Zellenfunknetzkennung (temporären Zellenfunknetzkennung, C-RNTI), einer Zielzellenkennung und einer Fortsetzungskonstante erzeugen.

source: [0165] Step 307: The source base station sends a context response message to the target base station if checking the message authentication code to be successful.
de_de: [0165] Schritt 307: Die Quellbasisstation sendet eine Kontextantwortnachricht an die Zielbasisstation, wenn sie prüft, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0166] The context response message may include the context of the terminal, for example, include the integrity protection algorithm of the source base station and the integrity protection key of the source base station.
de_de: [0166] Die Kontextantwortnachricht kann den Kontext des Endgeräts enthalten, zum Beispiel den Integritätsschutzalgorithmus der Quellbasisstation und den Integritätsschutzschlüssel der Quellbasisstation enthalten.

source: Optionally, the context response message further includes generated KgNB*.
de_de: Optional enthält die Kontextantwortnachricht ferner den erzeugten KgNB*.

source: [0167] Step 308: The target base station sends a connection resume response message to the terminal, and the terminal receives the connection resume response message from the target base station.
de_de: [0167] Schritt 308: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeantwortnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation.

source: [0168] The connection resume response message is used to instruct the terminal to resume the RRC connection.
de_de: [0168] Die Verbindungswiederaufnahmeantwortnachricht wird verwendet, um das Endgerät anzuweisen, die RRC-Verbindung wiederaufzunehmen.

source: Optionally, encryption and integrity protection may be respectively performed on the connection resume response message by using an encryption key and the integrity protection key that are generated by the target base station based on the integrity protection algorithm of the source base station and KgNB*.KgNB* used by the target base station may be from the source base station.
de_de: Optional können Verschlüsselung und Integritätsschutz jeweils an der Verbindungswiederaufnahmeantwortnachricht unter Verwendung eines Verschlüsselungsschlüssels und des Integritätsschutzschlüssels durchgeführt werden, die durch die Zielbasisstation basierend auf dem Integritätsschutzalgorithmus der Quellbasisstation und KgNB* erzeugt werden.KgNB*, der durch die Zielbasisstation verwendet wird, kann von der Quellbasisstation sein.

source: For a specific implementation process, refer to a related solution in the prior art. Details are not described.
de_de: Für einen spezifischen Implementierungsprozess sei auf eine betreffende Lösung im Stand der Technik hingewiesen. Details werden nicht beschrieben.

source: [0169] After step 308, a subsequent procedure of entering the connected state by the terminal from the inactive state is further included.
de_de: [0169] Nach Schritt 308 wird ferner eine nachfolgende Prozedur des Eintretens in den verbundenen Zustand durch das Endgerät aus dem inaktiven Zustand eingeschlossen.

source: This is content of the prior art. For specific details, refer to descriptions in related documents.
de_de: Dies ist ein Inhalt des Stands der Technik. Für spezifische Einzelheiten wird auf Beschreibungen in betreffenden Dokumenten Bezug genommen.

source: Details are not described.
de_de: Einzelheiten werden nicht beschrieben.

source: [0170] The following problems exist in the foregoing connection resume method.
de_de: [0170] Bei dem vorstehenden Verbindungswiederaufnahmeverfahren bestehen die folgenden Probleme.

source: [0171] In one aspect, if the manner 1 is used to generate the message authentication code in step 301, the message authentication code generated by the terminal each time is the same.
de_de: [0171] Wenn bei einem Aspekt die Weise 1 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen, ist der Nachrichtenauthentifizierungscode, der von dem Endgerät jedes Mal erzeugt wird, derselbe.

source: When the terminal sends the connection resume request message to the target base station for the first time, if the target base station rejects the connection resume request of the terminal, before the terminal sends the connection resume request message next time (that is, the second time), an attacker may steal the message authentication code carried when the terminal sends the connection resume request message for the first time.
de_de: Wenn das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum ersten Mal an die Zielbasisstation sendet, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, bevor das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht das nächste Mal (das heißt das zweite Mal) sendet, kann ein Angreifer den übertragenen Nachrichtenauthentifizierungscode stehlen, wenn das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum ersten Mal sendet.

source: Then, the attacker pretends to be the terminal and sends a connection resume request message to the target base station, where the connection resume request message carries the message authentication code stolen by the attacker.
de_de: Dann gibt der Angreifer vor, das Endgerät zu sein, und sendet eine Verbindungswiederaufnahmeanforderungsnachricht an die Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht den vom Angreifer gestohlenen Nachrichtenauthentifizierungscode trägt.

source: If load of the target base station is not very heavy, step 305 to step 308 are performed.
de_de: Wenn die Last der Zielbasisstation nicht sehr hoch ist, werden Schritt 305 bis Schritt 308 ausgeführt.

source: Consequently, the source base station checks the message authentication code to be successful, then adds the context of the terminal to the context response message, and sends the context response message to the target base station.
de_de: Folglich prüft die Quellbasisstation den Nachrichtenauthentifizierungscode als erfolgreich, fügt dann den Kontext des Endgeräts zu der Kontextantwortnachricht hinzu und sendet die Kontextantwortnachricht an die Zielbasisstation.

source: In addition, the source base station deletes the context of the terminal. Further, when the terminal resends the connection resume request message to the target base station for the second time, because the source base station has deleted the context of the terminal, the terminal cannot be authenticated.
de_de: Außerdem löscht die Quellbasisstation den Kontext des Endgeräts. Wenn das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum zweiten Mal erneut an die Zielbasisstation sendet, weil die Quellbasisstation den Kontext des Endgeräts gelöscht hat, kann das Endgerät nicht authentifiziert werden.

source: Consequently, the terminal cannot enter the connected state from the inactive state.
de_de: Folglich kann das Endgerät nicht aus dem inaktiven Zustand in den verbundenen Zustand eintreten.

source: Certainly, if load of the target base station is relatively heavy, the target base station rejects the connection resume request of the attacker, but the attacker may continuously attack the target base station until the target base station accepts the connection resume request of the attacker.
de_de: Wenn die Last der Zielbasisstation relativ hoch ist, lehnt die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Angreifers sicher ab, aber der Angreifer kann die Zielbasisstation kontinuierlich angreifen, bis die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Angreifers akzeptiert.

source: Therefore, the manner 1 has the foregoing problem of being vulnerable to an attack, and consequently, the terminal may not enter the connected state from the inactive state.
de_de: Daher weist die Weise 1 das vorstehende Problem auf, anfällig für einen Angriff zu sein, und folglich kann das Endgerät aus dem inaktiven Zustand nicht in den verbundenen Zustand eintreten.

source: [0172] In another aspect, if the manner 2 is used to generate the message authentication code in step 301, the message authentication code generated by the terminal each time is different.
de_de: [0172] bei einem weiteren Aspekt, wenn die Weise 2 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen, ist der Nachrichtenauthentifizierungscode, der von dem Endgerät jedes Mal erzeugt wird, unterschiedlich.

source: When the terminal sends the connection resume request message to the target base station for the first time, if the target base station rejects the connection resume request of the terminal, because the access stratum key stored in the terminal is already updated to KgNB* in this case, but the target base station does not notify the source base station that the key is already updated, the access stratum key stored in the source base station is still the original access stratum key KgNB.
de_de: Wenn das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum ersten Mal an die Zielbasisstation sendet, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, weil der in dem Endgerät gespeicherte Zugriffsschichtschlüssel in diesem Fall bereits auf KgNB* aktualisiert ist, die Zielbasisstation jedoch die Quellbasisstation nicht benachrichtigt, dass der Schlüssel bereits aktualisiert ist, ist der in der Quellbasisstation gespeicherte Zugriffsschichtschlüssel immer noch der ursprüngliche Zugriffsschichtschlüssel KgNB.

source: Further, when the terminal sends the connection resume request message to the target base station for the second time, if the target base station accepts the connection resume request of the terminal, the access stratum key stored in the terminal is KgNB*, and the access stratum key stored in the source base station is KgNB.
de_de: Wenn das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum zweiten Mal an die Zielbasisstation sendet, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts akzeptiert, ist der in dem Endgerät gespeicherte Zugriffsschichtschlüssel KgNB* und der in der Quellbasisstation gespeicherte Zugriffsschichtschlüssel KgNB.

source: Consequently, the source base station fails to check the message authentication code sent by the terminal, and the terminal cannot enter the connected state from the inactive state.
de_de: Folglich kann die Quellbasisstation den von dem Endgerät gesendeten Nachrichtenauthentifizierungscode nicht überprüfen, und das Endgerät kann aus dem inaktiven Zustand nicht in den verbundenen Zustand eintreten.

source: Therefore, the manner 2 may also have a problem that the terminal cannot enter the connected state from the inactive state.
de_de: Daher kann die Weise 2 auch ein Problem aufweisen, dass das Endgerät nicht aus dem inaktiven Zustand in den verbundenen Zustand eintreten kann.

source: [0173] For the foregoing problem in the connection resume request method shown in FIG. 3, this application provides the following solutions.
de_de: [0173] Für das vorstehende Problem in dem in FIG. 3 gezeigten Verbindungswiederaufnahmeanforderungsverfahren stellt diese Anwendung die folgenden Lösungen bereit.

source: Descriptions are separately provided below.
de_de: Nachfolgend werden Beschreibungen separat bereitgestellt.

source: [0174] Solution 1
de_de: [0174] Lösung 1
